In [1]:
import pandas as pd
schema_df = pd.read_csv(r"C:\Users\amand\Desktop\pandas\survey_results_schema.csv")
df_a = pd.read_csv(r"C:\Users\amand\Desktop\pandas\survey_results_public.csv")
people = {"Name":["aman","desk","demo"],
          "last_name":["aa","dd","de"],
           "email":["aa@gmail.com","dd@yandex.com","de@hotmail.com"]}
df = pd.DataFrame(people)

In [2]:
df

   Name last_name           email
0  aman        aa    aa@gmail.com
1  desk        dd   dd@yandex.com
2  demo        de  de@hotmail.com

In [3]:
df.columns

Index(['Name', 'last_name', 'email'], dtype='object')

In [4]:
df.columns = ["first_name","last_name","email"] #updating column names

In [5]:
df

  first_name last_name           email
0       aman        aa    aa@gmail.com
1       desk        dd   dd@yandex.com
2       demo        de  de@hotmail.com

In [6]:
df.columns = [x.lower() for x in df.columns] #change casing of letters using for loop
df

  first_name last_name           email
0       aman        aa    aa@gmail.com
1       desk        dd   dd@yandex.com
2       demo        de  de@hotmail.com

In [7]:
df.columns = df.columns.str.replace("_","_") #replce character of columns

In [8]:
df

  first_name last_name           email
0       aman        aa    aa@gmail.com
1       desk        dd   dd@yandex.com
2       demo        de  de@hotmail.com

In [9]:
df.rename(columns={'first_name':"first","last_name":"last"},inplace = True) #changing specific columns
df

  first last           email
0  aman   aa    aa@gmail.com
1  desk   dd   dd@yandex.com
2  demo   de  de@hotmail.com

In [10]:
df.loc[2] = ["am","an","aa@gmai.com"] #updating specic columns
df

  first last          email
0  aman   aa   aa@gmail.com
1  desk   dd  dd@yandex.com
2    am   an    aa@gmai.com

In [11]:
df.loc[2,["last","email"]]= ["deep","deep@gmail.com"] #changing specific data values

In [12]:
df

  first  last           email
0  aman    aa    aa@gmail.com
1  desk    dd   dd@yandex.com
2    am  deep  deep@gmail.com

In [13]:
df.loc[2,"last"] = "Smith" #changing single values
df

  first   last           email
0  aman     aa    aa@gmail.com
1  desk     dd   dd@yandex.com
2    am  Smith  deep@gmail.com

In [14]:
df.at[2,"last"] = "musk" #same work as loc but at is for good for single values 
df

  first  last           email
0  aman    aa    aa@gmail.com
1  desk    dd   dd@yandex.com
2    am  musk  deep@gmail.com

In [15]:
filt = df["email"] == "aa@gmail.com" #assignment opertion doesn't work this way
df[filt]["last"] ="games"

<ipython-input-15-94b9bc06a79a>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]["last"] ="games"

In [16]:
filt = (df["email"] == "aa@gmail.com") #same change can be done using loc
df.loc[filt,"last"] = "smith"
df

  first   last           email
0  aman  smith    aa@gmail.com
1  desk     dd   dd@yandex.com
2    am   musk  deep@gmail.com

In [17]:
df["email"] = df["email"].str.lower() #changing all data at a time
df

  first   last           email
0  aman  smith    aa@gmail.com
1  desk     dd   dd@yandex.com
2    am   musk  deep@gmail.com

In [18]:
df["email"].apply(len) #using apply method to get length of email

0    12
1    13
2    14
Name: email, dtype: int64

In [19]:
def update_email(email):
    return email.upper()

In [20]:
df["email"] = df["email"].apply(update_email) #using apply method to get 
df

  first   last           email
0  aman  smith    AA@GMAIL.COM
1  desk     dd   DD@YANDEX.COM
2    am   musk  DEEP@GMAIL.COM

In [21]:
df["email"] = df["email"].apply(lambda x : x.lower()) #using lambda functions with apply method
df

  first   last           email
0  aman  smith    aa@gmail.com
1  desk     dd   dd@yandex.com
2    am   musk  deep@gmail.com

In [22]:
df.apply(len) #gives number of rows and columns

first    3
last     3
email    3
dtype: int64

In [23]:
df.apply(pd.Series.min) #get smallest value in each row, work only for series

first              am
last               dd
email    aa@gmail.com
dtype: object

In [24]:
df.applymap(len) #applymap apply len method to every individual element to our data frame

   first  last  email
0      4     5     12
1      4     2     13
2      2     4     14

In [25]:
df.applymap(str.lower) #make lowercase everything

  first   last           email
0  aman  smith    aa@gmail.com
1  desk     dd   dd@yandex.com
2    am   musk  deep@gmail.com

In [26]:
#map method only work for series data frame and used to substitute each value

In [27]:
df["first"].map({"aman":"nama","desk":"sedk"}) #value that not provided change with NAN

0    nama
1    sedk
2     NaN
Name: first, dtype: object

In [28]:
df["first"] = df["first"].replace({"aman":"nama","desk":"sedk"}) #works better than above

In [29]:
df_a.rename(columns = {"ConvertedComp":"Salary"},inplace= True) #rename ConvertedComp to Salary
df_a["Salary"]

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
         ..
64456   NaN
64457   NaN
64458   NaN
64459   NaN
64460   NaN
Name: Salary, Length: 64461, dtype: float64

In [30]:
df_a["Hobbyist"] = df_a["Hobbyist"].map({"Yes":True,"No":False})

In [31]:
df_a

,Respondent,MainBranch,Hobbyist,Age,Age1stCode,CompFreq,CompTotal,Salary,Country,CurrencyDesc,...,SurveyEase,SurveyLength,Trans,UndergradMajor,WebframeDesireNextYear,WebframeWorkedWith,WelcomeChange,WorkWeekHrs,YearsCode,YearsCodePro
0,1,I am a developer by profession,True,NaN,13,Monthly,NaN,NaN,Germany,European Euro,...,Neither easy nor difficult,Appropriate in length,No,"Computer science, computer engineering, or sof...",ASP.NET Core,ASP.NET;ASP.NET Core,Just as welcome now as I felt last year,50.0,36,27
1,2,I am a developer by profession,False,NaN,19,NaN,NaN,NaN,United Kingdom,Pound sterling,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat more welcome now than last year,NaN,7,4
2,3,I code primarily as a hobby,True,NaN,15,NaN,NaN,NaN,Russian Federation,NaN,...,Neither easy nor difficult,Appropriate in length,NaN,NaN,NaN,NaN,Somewhat more welcome now than last year,NaN,4,NaN
3,4,I am a developer by profession,True,25.0,18,NaN,NaN,NaN,Albania,Albanian lek,...,NaN,NaN,No,"Computer science, computer engineering, or sof...",NaN,NaN,Somewhat less welcome now than last year,40.0,7,4
4,5,"I used to be a developer by profession, but no...",True,31.0,16,NaN,NaN,NaN,United States,NaN,...,Easy,Too short,No,"Computer science, computer engineering, or sof...",Django;Ruby on Rails,Ruby on Rails,Just as welcome now as I felt last year,NaN,15,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
64456,64858,NaN,True,NaN,16,NaN,NaN,NaN,United States,NaN,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",NaN,NaN,NaN,NaN,10,Less than 1 year
64457,64867,NaN,True,NaN,NaN,NaN,NaN,NaN,Morocco,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64458,64898,NaN,True,NaN,NaN,NaN,NaN,NaN,Viet Nam,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
64459,64925,NaN,True,NaN,NaN,NaN,NaN,NaN,Poland,NaN,...,NaN,NaN,NaN,NaN,Angular;Angular.js;React.js,NaN,NaN,NaN,NaN,NaN
64460,65112,NaN,True,NaN,NaN,NaN,NaN,NaN,Spain,NaN,...,NaN,NaN,NaN,"Computer science, computer engineering, or sof...",ASP.NET Core;jQuery,Angular;Angular.js;ASP.NET Core;jQuery,NaN,NaN,NaN,NaN